In [1]:
import pandas as pd
import mysql.connector

In [2]:
dict_creacion = {"generos" : """CREATE TABLE generos (
                                    id_genero INT AUTO_INCREMENT PRIMARY KEY,
                                    nombre_genero VARCHAR(50) NOT NULL,
                                    descripcion TEXT
                                    )""",
                "peliculas": """CREATE TABLE peliculas (
                                    id_pelicula INT AUTO_INCREMENT PRIMARY KEY,
                                    nombre VARCHAR(100) NOT NULL,
                                    duracion INT NOT NULL,
                                    direccion VARCHAR(100) NOT NULL,
                                    id_genero INT NOT NULL,
                                    fecha_estreno DATE NOT NULL,
                                    FOREIGN KEY (id_genero) 
                                        REFERENCES generos(id_genero)
                                    )""",
                "clientes": """CREATE TABLE clientes (
                                    id_cliente INT AUTO_INCREMENT PRIMARY KEY,
                                    nombre VARCHAR(50) NOT NULL,
                                    apellido VARCHAR(50) NOT NULL,
                                    direccion VARCHAR(100),
                                    telefono VARCHAR(15),
                                    email VARCHAR(100),
                                    fecha_registro DATE NOT NULL
                                    )""",
                "alquileres": """CREATE TABLE alquileres (
                                    id_alquiler INT AUTO_INCREMENT PRIMARY KEY,
                                    id_cliente INT NOT NULL,
                                    id_pelicula INT NOT NULL,
                                    fecha_alquiler DATE NOT NULL,
                                    fecha_devolucion DATE,
                                    estado ENUM('pendiente', 'devuelto') NOT NULL,
                                    FOREIGN KEY (id_cliente) 
                                        REFERENCES clientes(id_cliente)
                                        ON DELETE CASCADE
                                        ON UPDATE CASCADE,
                                    FOREIGN KEY (id_pelicula) 
                                        REFERENCES peliculas(id_pelicula)
                                        ON DELETE CASCADE
                                        ON UPDATE CASCADE
                                )"""}

In [3]:
cnx = mysql.connector.connect(user='root', password='AlumnaAdalab',
                              host='127.0.0.1'
                              )

# iniciamos el cursor  -> creamos el "camioncito"                             
mycursor = cnx.cursor()

In [4]:
mycursor.execute("CREATE SCHEMA videoclub")
mycursor.execute("USE videoclub")

In [8]:
for k, v in dict_creacion.items():
    print(f"estamos creando la tabla {k}")
    mycursor.execute(v)

    print("-------------------------------")

estamos creando la tabla generos
-------------------------------
estamos creando la tabla peliculas
-------------------------------
estamos creando la tabla clientes
-------------------------------
estamos creando la tabla alquileres
-------------------------------

In [ ]:
def lanzar_query (bbdd, query):
    cnx = mysql.connector.connect(user='root', password='AlumnaAdalab',
                                host='127.0.0.1', database = bbdd
                                )
    mycursor = cnx.cursor()
    mycursor.execute(query)
    cnx.close()

In [10]:
modificar_columna = """ALTER TABLE clientes
                            MODIFY COLUMN email VARCHAR(200) NOT NULL;"""

lanzar_query("videoclub", modificar_columna)

In [11]:
modificar_alquileres = """ALTER TABLE alquileres
                                MODIFY COLUMN estado ENUM ('PENDIENTE', 'DEVUELTO') DEFAULT 'PENDIENTE';"""

In [12]:
lanzar_query("videoclub", modificar_alquileres)

In [13]:
def insertar(bbdd, query, valores):
    cnx = mysql.connector.connect(user='root', password='AlumnaAdalab',
                              host='127.0.0.1', database = bbdd
                              )
    mycursor = cnx.cursor()
    mycursor.executemany(query, valores)
    print(mycursor.rowcount, "registros insertados")
    cnx.commit()

    cnx.close()

In [15]:
query_insert = '''
                    INSERT INTO generos (nombre_genero, descripcion)
                        VALUES (%s, %s)
                                '''

In [16]:
generos = [('Acción', 'Películas llenas de emoción y aventuras'),
('Comedia', 'Películas para reír y disfrutar'),
('Drama', 'Películas emocionales y profundas'),
('Ciencia Ficción', 'Películas con elementos futuristas o tecnológicos')]

In [17]:
insertar("videoclub", query_insert, generos)

4 registros insertados

In [27]:
df_clientes = pd.read_csv("files/clientes.csv", header=None, names=['nombre', 'apellido', 'direccion', 'telefono', 'email', 'fecha_registro'])

In [28]:
df_clientes.head()

,nombre,apellido,direccion,telefono,email,fecha_registro
0,Miguel,Navarro,Calle Central 449,555-7961,ana@example.com,2023-02-27
1,Carmen,Navarro,Calle Norte 659,555-8199,ana@example.com,2024-10-25
2,Sofía,Ruiz,Calle Oeste 504,555-9360,ana@example.com,2023-01-10
3,Carlos,Herrera,Calle Sol 533,555-7115,jorge@example.com,2024-03-13
4,Fernando,Navarro,Calle Estrella 446,555-4390,ana@example.com,2023-04-15

In [29]:
df_clientes.tail()

,nombre,apellido,direccion,telefono,email,fecha_registro
145,Alberto,Vega,Calle Luna 947,555-8111,sofia@example.com,2023-09-05
146,Carlos,Fernández,Calle Sur 224,555-4859,pedro@example.com,2023-02-16
147,Claudia,García,Calle Oeste 690,555-9656,sofia@example.com,2024-11-14
148,Andrés,Domínguez,Calle Este 479,555-8572,elena@example.com,2023-09-06
149,Sofía,Gil,Calle Libertad 402,555-9261,maria@example.com,2023-04-27

In [38]:
df_clientes.sample(3)

,nombre,apellido,direccion,telefono,email,fecha_registro
63,Laura,López,Calle Unión 112,555-6676,pedro@example.com,2024-02-14
103,Carmen,Martínez,Calle Central 578,555-1861,ana@example.com,2023-06-18
138,Lucía,Torres,Calle Luna 523,555-6285,ana@example.com,2023-09-22

In [39]:
df_clientes.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   nombre          150 non-null    object
 1   apellido        150 non-null    object
 2   direccion       150 non-null    object
 3   telefono        150 non-null    object
 4   email           150 non-null    object
 5   fecha_registro  150 non-null    object
dtypes: object(6)
memory usage: 7.2+ KB

In [43]:
df_clientes["nombre"]

0        Miguel
1        Carmen
2         Sofía
3        Carlos
4      Fernando
         ...
145     Alberto
146      Carlos
147     Claudia
148      Andrés
149       Sofía
Name: nombre, Length: 150, dtype: object

In [41]:
df_clientes["nombre"].unique()

array(['Miguel', 'Carmen', 'Sofía', 'Carlos', 'Fernando', 'Marta',
       'Claudia', 'Patricia', 'Pedro', 'Alberto', 'Andrés', 'Rafael',
       'Luis', 'María', 'Jorge', 'Ana', 'Elena', 'Ricardo', 'Lucía',
       'Laura'], dtype=object)

In [42]:
df_clientes.shape

(150, 6)

In [44]:
df_clientes.head()

,nombre,apellido,direccion,telefono,email,fecha_registro
0,Miguel,Navarro,Calle Central 449,555-7961,ana@example.com,2023-02-27
1,Carmen,Navarro,Calle Norte 659,555-8199,ana@example.com,2024-10-25
2,Sofía,Ruiz,Calle Oeste 504,555-9360,ana@example.com,2023-01-10
3,Carlos,Herrera,Calle Sol 533,555-7115,jorge@example.com,2024-03-13
4,Fernando,Navarro,Calle Estrella 446,555-4390,ana@example.com,2023-04-15

In [49]:
lista_clientes = df_clientes.values.tolist()

lista_clientes[:3]

[['Miguel',
  'Navarro',
  'Calle Central 449',
  '555-7961',
  'ana@example.com',
  '2023-02-27'],
 ['Carmen',
  'Navarro',
  'Calle Norte 659',
  '555-8199',
  'ana@example.com',
  '2024-10-25'],
 ['Sofía',
  'Ruiz',
  'Calle Oeste 504',
  '555-9360',
  'ana@example.com',
  '2023-01-10']]

In [50]:
df_clientes.itertuples()

In [53]:
for tup in df_clientes.itertuples(index=False, name=None):
    print(tup)
    break

('Miguel', 'Navarro', 'Calle Central 449', '555-7961', 'ana@example.com', '2023-02-27')

In [56]:
lista_clientes = list(df_clientes.itertuples(index=False, name=None))

lista_clientes[:1]

[('Miguel',
  'Navarro',
  'Calle Central 449',
  '555-7961',
  'ana@example.com',
  '2023-02-27')]

In [60]:
lista_tuplas_clientes = list(df_clientes.to_records(index=False))

lista_tuplas_clientes[:1]

[np.record(('Miguel', 'Navarro', 'Calle Central 449', '555-7961', 'ana@example.com', '2023-02-27'), dtype=[('nombre', 'O'), ('apellido', 'O'), ('direccion', 'O'), ('telefono', 'O'), ('email', 'O'), ('fecha_registro', 'O')])]

In [61]:
df_clientes.to_records(index=False).tolist()[:1]

[('Miguel',
  'Navarro',
  'Calle Central 449',
  '555-7961',
  'ana@example.com',
  '2023-02-27')]

In [62]:
query = 'INSERT INTO clientes (nombre, apellido, direccion, telefono, email, fecha_registro) VALUES (%s, %s, %s, %s, %s, %s)'

In [63]:
insertar("videoclub", query, lista_clientes)

150 registros insertados

In [64]:
cnx = mysql.connector.connect(user='root', password='AlumnaAdalab',
                              host='127.0.0.1'
                              )

# iniciamos el cursor  -> creamos el "camioncito"                             
mycursor = cnx.cursor()